20220303024930-multiplication.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-04 Fri 21:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Multiplication</title>
<meta name="author" content="IAmParadox" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Multiplication</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8db95b7">1. Definition 2.3.1 (Multiplication of natural numbers)</a></li>
<li><a href="#orge891ad8">2. Lemma 2.3.2 (Multiplication is commutative).</a></li>
<li><a href="#org2199ee2">3. Lemma 2.3.3 (Positive natural numbers have no zero divisors).</a></li>
<li><a href="#org43cf0fd">4. Proposition 2.3.4 (Distributive Law)</a></li>
<li><a href="#orgbe931e8">5. Proposition 2.3.5 (Multiplication is associative).</a></li>
<li><a href="#orge3da123">6. Proposition 2.3.6 (Multiplication preserves order).</a></li>
<li><a href="#orgeed4091">7. Corollary 2.3.7 (Cancellation Law).</a></li>
<li><a href="#org22a42d3">8. Proposition 2.3.9 (Euclidean algorithm)</a></li>
<li><a href="#org0181e34">9. Definition 2.3.11 (Exponentiation for natural numbers).</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8db95b7" class="outline-2">
<h2 id="org8db95b7"><span class="section-number-2">1.</span> Definition 2.3.1 (Multiplication of natural numbers)</h2>
<div class="outline-text-2" id="text-1">
<p>
Let \(m\) be a natural number. To multiply zero to \(m\), we define \(0 \times m := 0\). Now suppose inductively that we have
defined how to multiply \(n\) to \(m\). Then we can multiply \(n++\) to \(m\) by defining \((n++) \times := (n \times m) + m\).
</p>
</div>
</div>

<div id="outline-container-orge891ad8" class="outline-2">
<h2 id="orge891ad8"><span class="section-number-2">2.</span> Lemma 2.3.2 (Multiplication is commutative).</h2>
<div class="outline-text-2" id="text-2">
<p>
Let \(n,m\) be <i>natural numbers</i>. Then \(n \times m = m \times n\).
</p>
</div>
</div>

<div id="outline-container-org2199ee2" class="outline-2">
<h2 id="org2199ee2"><span class="section-number-2">3.</span> Lemma 2.3.3 (Positive natural numbers have no zero divisors).</h2>
<div class="outline-text-2" id="text-3">
<p>
Let \(n,m\) be <i>natural numbers</i>. Then \(n \times m = 0\) iff at least one of \(n,m\) is equal to <i>zero</i>.
In particular, if \(n\) and \(m\) are both positive, then \(n \times m\) is also positive.
</p>
</div>
</div>

<div id="outline-container-org43cf0fd" class="outline-2">
<h2 id="org43cf0fd"><span class="section-number-2">4.</span> Proposition 2.3.4 (Distributive Law)</h2>
<div class="outline-text-2" id="text-4">
<p>
For any <i>natural numbers</i> \(a,b,c\) we have \(a(b + c) = ab + ac\) and \((b + c)a = ba + ca\).
</p>
</div>
</div>

<div id="outline-container-orgbe931e8" class="outline-2">
<h2 id="orgbe931e8"><span class="section-number-2">5.</span> Proposition 2.3.5 (Multiplication is associative).</h2>
<div class="outline-text-2" id="text-5">
<p>
For any <i>natural numbers</i> \(a,b,c\), we have \((a \times b) \times c = a \times (b \times c)\).
</p>
</div>
</div>

<div id="outline-container-orge3da123" class="outline-2">
<h2 id="orge3da123"><span class="section-number-2">6.</span> Proposition 2.3.6 (Multiplication preserves order).</h2>
<div class="outline-text-2" id="text-6">
<p>
If \(a,b\) are <i>natural numbers</i> such that \(a<b\), and \(c\) is <i>positive</i>, then \(ac < bc\).
</p>
</div>
</div>

<div id="outline-container-orgeed4091" class="outline-2">
<h2 id="orgeed4091"><span class="section-number-2">7.</span> Corollary 2.3.7 (Cancellation Law).</h2>
<div class="outline-text-2" id="text-7">
<p>
Let \(a,b,c\) be <i>natural numbers</i> such that \(ac = bc\) and \(c\) is <i>non-zero</i>. Then \(a = b\).
</p>
</div>
</div>

<div id="outline-container-org22a42d3" class="outline-2">
<h2 id="org22a42d3"><span class="section-number-2">8.</span> Proposition 2.3.9 (Euclidean algorithm)</h2>
<div class="outline-text-2" id="text-8">
<p>
Let \(n\) be a <i>natural number</i>, and let \(q\) be a <i>positive number</i>. Then there exist <i>natural numbers</i> \(m,r\) such
that \(0 \leq r < q\) and \(n = mq + r\).
</p>
</div>
</div>

<div id="outline-container-org0181e34" class="outline-2">
<h2 id="org0181e34"><span class="section-number-2">9.</span> Definition 2.3.11 (Exponentiation for natural numbers).</h2>
<div class="outline-text-2" id="text-9">
<p>
Let \(m\) be a natural number. To raise \(m\) to the power \(0\), we define \(m^0 := 1\); in particular, we define \(0^0 := 1\).
Now suppose recursively that \(m^n\) has been defined for some natural numbers \(n\), then we define \(m^{n++} := m^n \times m\).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: IAmParadox</p>
<p class="date">Created: 2022-03-04 Fri 21:13</p>
</div>
</body>
</html>
